01_codes/OF_cases/01_baseCaseV2/0.org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (10 0 0);
pressure             0;
turbulentKE          3.75e-1;
// turbulentKE          1e-6;
turbEps              2.07e-4;
// turbEps              1e-6;
turbulentOmega       6.12e-3;
inNutT               6.12e+1;
mixLenght            100;
turbInt              0.05;
initPol              0.0;

// ************************************************************************* //
