01_codes/OF_cases/01_baseCaseV2/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    //- Define inlet conditions
    inlet
    {
        type   turbulentIntensityKineticEnergyInlet;
        intensity   $turbInt;
        value $internalField;
    }

    outlet
    {
        type            zeroGradient;
        // type            inletOutlet;
        // inletValue      $internalField;
        // value           $internalField;
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    upperWall
    {
        type            slip;
        // type            inletOutlet;
        // inletValue      uniform 0;
        // value           $internalField;
        // type            zeroGradient;
    }

    "build1|build2|build3|build4"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
        type slip;
    }
}


// ************************************************************************* //
