01_codes/OF_cases/01_baseCaseV2/0.org/omegaOld
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    // #include "include/fixedInlet"

    inlet
    {
        type  fixedValue;
        value $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    upperWall
    {
        // type            zeroGradient;
        type            slip;
    }

    "build1|build2|build3|build4"
    {
        // type            omegaWallFunction;
        // value           $internalField;
        type            omegaWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
        type slip;
    }
}


// ************************************************************************* //
