01_codes/OF_cases/01_baseCaseV2/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            totalPressure;
        p0              $internalField;
        value           $internalField;
        // type            fixedValue;
        // value           $internalField;
        // type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    "build1|build2|build3|build4"
    {
        type            zeroGradient;
    }

    upperWall
    {
        type slip;
        // type            totalPressure;
        // p0              $internalField;
        // value           $internalField;
    }

    frontAndBack
    {
        type slip;
    }
}

// ************************************************************************* //
