01_codes/OF_cases/01_baseCaseV2/0.org/yPol
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      yPol;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches

    //- Define inlet conditions
    inlet
    {
        // type   turbulentIntensityKineticEnergyInlet;
        // intensity   $turbInt;
        // value $internalField;
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
        // type            inletOutlet;
        // inletValue      $internalField;
        // value           $internalField;
    }

    lowerWall
    {
        // type            kqRWallFunction;
        // value           $internalField;
        type               fixedValue;
        value           $internalField;
    }
    
    upperWall
    {
        type            zeroGradient;
        // type            inletOutlet;
        // inletValue      uniform 0;
        // value           $internalField;
        // type            zeroGradient;
    }

    "build1|build2|build3|build4"
    {
        // type            kqRWallFunction;
        // value           $internalField;
        type            zeroGradient;
    }

    frontAndBack
    {
        // type slip;
        type            zeroGradient;
    }
}


// ************************************************************************* //
