01_codes/OF_cases/01_baseCaseV2/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;
// simulationType laminar;

RAS
{
    // model               kOmegaSST;
    model               kEpsilon;

    RASModel        kEpsilon;

    turbulence          on;
    // turbulence          off;

    printCoeffs         on;
}

// ************************************************************************* //
