01_codes/OF_cases/01_baseCaseV2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

domainSizeX DOMAIN_SIZE_X;
domainSizeY DOMAIN_SIZE_Y;
domainSizeXM DOMAIN_SIZE_MX;
domainSizeYM DOMAIN_SIZE_MY;
domainSizeZ DOMAIN_SIZE_Z;

vertices
(
    ($domainSizeXM $domainSizeYM 0.01)
    ($domainSizeX $domainSizeYM 0.01)
    ($domainSizeX  $domainSizeY 0.01)
    ($domainSizeXM  $domainSizeY 0.01)
    ($domainSizeXM $domainSizeYM $domainSizeZ)
    ($domainSizeX $domainSizeYM $domainSizeZ)
    ($domainSizeX  $domainSizeY $domainSizeZ)
    ($domainSizeXM  $domainSizeY $domainSizeZ)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (NC_X NC_Y NC_Z) simpleGrading (1.5 1 3)
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
